wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/successful-transaction.json

{
    "type": "transaction",
    "id": "b332ca0a-1dce-4ae6-b27b-04f70db8fae7",
    "reconciliation_id": "5S8puSJHjzWXtSEbjHoiP9",
    "merchant_account_id": "default",
    "created_at": "2024-07-22T19:56:09.406614+00:00",
    "updated_at": "2024-07-22T19:56:22.853932+00:00",
    "amount": 3500,
    "authorized_amount": 3500,
    "captured_amount": 3500,
    "refunded_amount": 0,
    "currency": "USD",
    "country": "US",
    "external_identifier": "12354846.6",
    "status": "capture_succeeded",
    "intent": "authorize",
    "payment_method": {
        "type": "payment-method",
        "method": "card",
        "mode": "card",
        "label": "1111",
        "scheme": "visa",
        "expiration_date": "03/30",
        "approval_url": null,
        "country": "MX",
        "currency": null,
        "details": {
            "bin": "411111",
            "card_type": "credit"
        },
        "last_replaced_at": null,
        "fingerprint": "a50b85c200ee0795d6fd33a5c66f37a4564f554355c5b46a756aac485dd168a4",
        "id": null,
        "approval_target": null,
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "card",
    "instrument_type": "pan",
    "error_code": null,
    "payment_service": {
        "id": "9996be63-1e6f-4290-9d6e-b70f5d9b6bf8",
        "type": "payment-service",
        "payment_service_definition_id": "adyen-card",
        "method": "card",
        "display_name": "Adyen"
    },
    "pending_review": false,
    "buyer": {
        "id": "60c52dcd-8405-452d-8f7e-80f3d49b8f95",
        "type": "buyer",
        "display_name": "Jimmy Wales",
        "external_identifier": "jwales@example.com",
        "billing_details": {
            "first_name": "Jimmy",
            "last_name": "Wales",
            "email_address": "jwales@example.com",
            "phone_number": null,
            "address": {
                "city": "San Francisco",
                "country": "US",
                "postal_code": "94104",
                "state": "CA",
                "state_code": null,
                "house_number_or_name": null,
                "line1": "1 Montgomery Street",
                "line2": null,
                "organization": null
            },
            "tax_id": null
        }
    },
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "auth_response_code": null,
    "avs_response_code": "unavailable",
    "cvv_response_code": "unavailable",
    "payment_source": "ecommerce",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": null,
    "three_d_secure": null,
    "payment_service_transaction_id": "G7TWDQ5LBKKKP275",
    "metadata": null,
    "authorized_at": "2024-07-22T19:56:10.642724+00:00",
    "captured_at": "2024-07-22T19:56:22.853932+00:00",
    "voided_at": null,
    "approval_expires_at": null,
    "buyer_approval_timedout_at": null,
    "intent_outcome": "succeeded",
    "multi_tender": false
}